package constant.support;

public enum BoardText {
    // 고객센터 메인 메뉴
    CS_MENU("""
            ---------------------------------<< 고객 센터 >>----------------------------------
            메인 메뉴: 1.공지사항 | 2.1:1문의 | 3.FAQ | 4.뒤로가기
            메뉴 선택 >"""),

    LINE("--------------------------------------------------------------------------------"),

    BACK("[뒤로가기]]"),

    // 공지사항-----------------------------------------------------------------------------------------------------------
    NOTICE_MENU("""
            --------------------------------<< 공지사항 메뉴 >>--------------------------------
            공지사항 메뉴: 1.공지 생성 | 2.상세 조회 | 3.뒤로가기
            메뉴 선택 >"""),

    NOTICE_MENU_SIMPLE("""
            --------------------------------<< 공지사항 메뉴 >>--------------------------------
            공지사항 메뉴: 1.상세 조회 | 2.뒤로가기
            메뉴 선택 >"""),

    NOTICE_DETAIL_MENU("""
            ------------------------------<< 공지사항 상세 메뉴 >>-------------------------------
            공지사항 상세 메뉴: 1.수정 | 2.삭제 | 3.뒤로가기
            메뉴 선택 >"""),

    NOTICE_INSERT_ID("""
            공지 번호를 입력해주세요.
            >"""),

    NOTICE_CHOICE("[선택하신 공지]"),


    NOTICE_CREATE_SUCCESS("[공지사항이 성공적으로 생성되었습니다]"),
    NOTICE_CREATE_FAILURE("[공지사항 생성을 실패했습니다]"),

    NOTICE_UPDATE_SUCCESS("[공지사항이 성공적으로 수정되었습니다.]"),
    NOTICE_UPDATE_FAILURE("[공지사항 수정을 실패했습니다]"),

    NOTICE_DELETE_SUCCESS("[공지사항이 성공적으로 삭제되었습니다.]"),
    NOTICE_DELETE_FAILURE("[공지사항 삭제를 실패했습니다]"),

    // 1:1 문의----------------------------------------------------------------------------------------------------------
    INQUIRY_MENU("""
            -------------------------------<< 1:1 문의 메뉴 >>--------------------------------
            문의 메뉴: 1.문의 생성 | 2.상세 조회 | 3.뒤로가기
            메뉴 선택 >"""),

    INQUIRY_MENU_SIMPLE("""
            -------------------------------<< 1:1 문의 메뉴 >>--------------------------------
            문의 메뉴: 1.상세 조회 | 2.뒤로가기
            메뉴 선택 >"""),

    INQUIRY_DETAIL_MENU_MEMBER("""
            -----------------------------<< 1:1 문의 상세 메뉴 >>------------------------------
            문의 상세 메뉴: 1.수정 | 2.삭제 | 3.뒤로가기
            메뉴 선택 >"""),

    INQUIRY_DETAIL_MENU_MANAGER("""
            -----------------------------<< 1:1 문의 상세 메뉴 >>------------------------------
            문의 상세 메뉴: 1.답변 | 2.삭제 | 3.뒤로가기
            메뉴 선택 >"""),

    INQUIRY_INSERT_ID("""
            문의 번호를 입력해주세요.
            >"""),

    INQUIRY_CHOICE("[선택하신 문의]"),


    INQUIRY_CREATE_SUCCESS("[문의가 성공적으로 생성되었습니다]"),
    INQUIRY_CREATE_FAILURE("[문의 생성을 실패했습니다]"),

    INQUIRY_UPDATE_SUCCESS("[문의가 성공적으로 수정되었습니다.]"),
    INQUIRY_UPDATE_FAILURE("[문의 수정을 실패했습니다]"),

    INQUIRY_REPLY_SUCCESS("[문의가 성공적으로 답변되었습니다.]"),
    INQUIRY_REPLY_FAILURE("[문의 답변을 실패했습니다]"),

    INQUIRY_DELETE_SUCCESS("[문의가 성공적으로 삭제되었습니다.]"),
    INQUIRY_DELETE_FAILURE("[문의 삭제를 실패했습니다]"),

    // FAQ--------------------------------------------------------------------------------------------------------------
    FAQ_MENU("""
            ---------------------------------<< FAQ 메뉴 >>----------------------------------
            FAQ 메뉴: 1.FAQ 생성 | 2.상세 조회 | 3.뒤로가기
            메뉴 선택 >"""),

    FAQ_MENU_SIMPLE("""
            ---------------------------------<< FAQ 메뉴 >>----------------------------------
            FAQ 메뉴: 1.상세 조회 | 2.뒤로가기
            메뉴 선택 >"""),

    FAQ_DETAIL_MENU("""
            -------------------------------<< FAQ 상세 메뉴 >>--------------------------------
            FAQ 상세 메뉴: 1.수정 | 2.삭제 | 3.뒤로가기
            메뉴 선택 >"""),

    FAQ_INSERT_ID("""
            FAQ 번호를 입력해주세요.
            >"""),

    FAQ_CHOICE("[선택하신 FAQ]"),


    FAQ_CREATE_SUCCESS("[FAQ가 성공적으로 생성되었습니다]"),
    FAQ_CREATE_FAILURE("[FAQ 생성을 실패했습니다]"),

    FAQ_UPDATE_SUCCESS("[FAQ가 성공적으로 수정되었습니다.]"),
    FAQ_UPDATE_FAILURE("[FAQ 수정을 실패했습니다]"),

    FAQ_DELETE_SUCCESS("[FAQ가 성공적으로 삭제되었습니다.]"),
    FAQ_DELETE_FAILURE("[FAQ 삭제를 실패했습니다]"),

    //##################################################################################################################
    TITLE("""
            제목을 입력해주세요.
            >"""),

    CONTENT("""
            내용을 입력해주세요.
            >"""),


    FIXED("""
            상단에 고정하시겠습니까?
            Y/N >"""),

    QUESTION("""
            질문을 입력해주세요.
            >"""),

    REPLY("""
            답변을 입력해주세요.
            >"""),

    CATEGORY_CHOICE("""
            키테고리 번호를 입력해주세요.
            >"""),

    NOTICE_CREATE("[공지사항 생성]"),
    INQUIRY_CREATE("[문의 생성]"),
    FAQ_CREATE("[FAQ 생성]"),

    NOTICE_UPDATE("[공지사항 수정]"),
    INQUIRY_UPDATE("[문의 수정]"),
    INQUIRY_REPLY("[문의 답변]"),
    FAQ_UPDATE("[FAQ 수정]"),

    INQUIRY_CATEGORY("[문의 카테고리 목록]"),
    FAQ_CATEGORY("[FAQ 카테고리 목록]"),

    NOTICE_READ_ALL("------------------------------<< 공지사항 전체 목록 >>------------------------------"),
    INQUIRY_READ_ALL("------------------------------<< 1:1 문의 전체 목록 >>-----------------------------"),
    FAQ_READ_ALL("-------------------------------<< FAQ 전체 목록 >>--------------------------------"),

    CREATE_DATE("문의일"),
    REPLY_DATE("답변일"),
    CATEGORY("카테고리"),
    TITLE_("제목"),
    CONTENT_("내용"),
    QUEST("문의"),
    ANSWER("답변"),
    NUMBER("NO"),
    LIST_NAME("목록명"),
    REPLY_STATUS("답변상태"),
    REPLY_PENDING("[대기]"),
    REPLY_DONE("[완료]"),
    BACK_OPTION("[뒤로가시려면 'Y'를 입력해주세요]"),


    ;
    private final String message;

    BoardText(String message) {
        this.message = message;
    }

    public String getMessage() {
        return message;
    }

}
