package constant.user;

import domain.user.Manager;

public enum ManagerPage {

    // 관리자 전용 회원관리 기능
    MANAGER_MANAGEMENT_MENU_TITLE("""
            -------------------<< 관리자 회원관리 >>-------------------
            1.회원 조회 | 2.회원 수정 | 3.회원 삭제 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),

    // 관리자 전용 조회
    MANAGER_SELECT_TITLE("""
            -------------------<< 관리자 전용 조회 >>------------------
            1.회원상세보기 | 2.전체회원조회 | 3.권한별 회원목록 | 4.뒤로가기
            ---------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_DETAIL_INFO_TITLE("""
            -------------------<< 회원상세보기 >>-----------------------
            1.내 정보 조회 | 2.다른 회원 조회 | 3.뒤로가기
            ----------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    INPUT_ID_FOR_SEARCH("""
            -------------------<< 다른 회원정보 조회 >>------------------
            조회할 회원의 아이디를 입력해주세요.
            """),
    MANAGER_DETAIL("""
            ---------------<< 관리자 정보 상세조회 >>--------------------
            아이디: %1$s
            이름: %2$s
            연락처: %3$s
            이메일: %4$s
            입사일: %5$s
            직급: %6$s
            """),
    SEARCH_MANAGER_TITLE_FORMAT("""
            ---------------------------------------------------------<< 관리자 리스트 >>-----------------------------------------------------------------
            %s
            -------------------------------------------------------------------------------------------------------------------------------------------
            """),
    SEARCH_MANAGER_TITLE("%-11s\t%-5s"),
    SEARCHED_MANAGER_INFO("%-12s\t%-8s"),
    MANAGER_SEARCH_BY_ROLE_TITLE("""
            -------------------<< 권한별 회원조회 >>--------------------
            1.일반회원 | 2.관리자
            ----------------------------------------------------------
            특정 권한을 보유한 회원 목록을 조회할 수 있습니다.
            어떤 권한을 보유한 회원을 조회할 것인지 선택해주세요.(1,2 중 택1)
            """),

    // 관리자 전용 수정 기능
    MANAGER_UPDATE_TITLE("""
            --------------------------<< 관리자 전용 수정 >>--------------------------------------------
            1.내 정보 수정 | 2.회원가입 승인 | 3.회원 권한 부여 | 4.이전 계정 복구 | 5.창고 배정 | 6.뒤로가기
            ------------------------------------------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    MANAGER_UPDATE_SUBTITLE("--------------------<< 관리자 회원정보 수정 >>--------------------------"),

    INPUT_ID_FOR_APPROVE("""
            -------------------<< 회원가입 승인 >>--------------------
            회원가입을 승인할 아이디를 입력해주세요.
            """),
    APPROVE_COMPLETE("회원가입 승인이 완료되었습니다."),
    APPROVE_FAILED("이미 사용 중인 계정입니다. 승인을 진행할 수 없습니다."),

    INPUT_ID_FOR_UPDATE_ROLE("""
            -------------------<< 회원 권한 부여 >>--------------------
            권한을 다시 부여할 회원의 아이디를 입력해주세요.
            """),
    ROLE_UPDATE_OPTION("""
            -------------------<< 회원 권한 부여 >>--------------------
            1.일반회원 | 2.창고관리자
            ----------------------------------------------------------
            회원에게 부여할 권한을 선택해주세요.(1,2 중 택1)
            """),
    ALREADY_HAVE_ROLE("이미 부여된 권한이 있는 회원입니다."),
    ROLE_UPDATE_COMPLETE("회원 권한 부여가 완료되었습니다."),
    ROLE_UPDATE_FAILED("회원 권한 부여를 수행하지 못했습니다."),

    INPUT_ID_FOR_RESTORE("""
            -------------------<< 회원 계정 복구 >>--------------------
            회원탈퇴 철회를 진행할 회원의 아이디를 입력해주세요.
            """),
    RESTORE_COMPLETE("회원탈퇴 철회가 완료되었습니다."),
    RESTORE_FAILED("이미 사용 중이거나 이전에 가입한 적이 없는 아이디입니다. 회원 복구를 진행할 수 없습니다."),

    INPUT_MANAGER_FOR_ADD_CARGO("창고를 배정할 창고관리자의 아이디를 입력해주세요.\n"),
    INPUT_CARGO_ID("관리자에게 배정할 창고의 아이디를 입력해주세요.\n"),
    CARGO_ADD_SUCCESS("관리자에게 %s번 창고가 배정되었습니다.\n"),
    CARGO_ADD_FAILED("관리자에게 창고를 배정하지 못했습니다."),

    // 관리자 전용 삭제 기능
    MANAGER_DELETE_TITLE("""
            -------------------<< 관리자 전용 삭제 >>--------------------
            1.회원 탈퇴 | 2.회원 권한 삭제 | 3.뒤로가기
            -----------------------------------------------------------
            메뉴를 선택해주세요.
            """),
    INPUT_ID_FOR_DELETE_ROLE("""
            -------------------<< 회원 권한 삭제 >>--------------------
            권한을 삭제할 회원의 아이디를 입력해주세요.
            """),
    ROLE_DELETE_COMPLETE("회원 권한 삭제가 완료되었습니다."),
    ROLE_DELETE_FAILED("회원 권한 삭제를 완료하지 못했습니다."),

    NOT_HAVE_PERMISSION("권한이 낮아 해당 작업을 수행할 수 없습니다."),
    ALREADY_DELETED_OR_NOT_EXIST("이미 권한이 삭제되었거나 존재하지 않는 회원입니다."),
    CHIEF_MANAGER_CANNOT_DELETE("총관리자는 삭제할 수 없습니다.");

    private final String page;

    ManagerPage(String page) {
        this.page = page;
    }

    public static void details(Manager manager) {
        System.out.printf(MANAGER_DETAIL.toString(),
                manager.getId(), manager.getName(), manager.getPhone(),
                manager.getEmail(), manager.getHireDate(), manager.getType());
    }

    public static String managerInfoTitle() {
        return String.format(SEARCH_MANAGER_TITLE_FORMAT.toString(),
                UserPage.userCommonInfoTitle() + String.format(SEARCH_MANAGER_TITLE.toString(), "입사일", "직급"));
    }

    @Override
    public String toString() {
        return page;
    }
}
