package constant.user;

public enum WMSMessage {

    MANAGER_MENU_TITLE("""
            ---------------------------<< 관리자 WMS 메뉴 >>-----------------------------
            1.회원관리 | 2.고객센터 | 3.창고관리 | 4.재고관리 | 5.입고 | 6.출고 | 7.로그아웃
            ---------------------------------------------------------------------------
            메뉴를 선택해주세요.
            """),

    MEMBER_MENU_TITLE("""
            --------------------------<< 일반회원 WMS 메뉴 >>----------------------------
            1.회원관리 | 2.고객센터 | 3.재고관리 | 4.입고 | 5.출고 | 6.로그아웃
            ---------------------------------------------------------------------------
            메뉴를 선택해주세요.
            """);

    private final String page;

    WMSMessage(String page) {
        this.page = page;
    }

    @Override
    public String toString() {
        return page;
    }
}
